Garden/app/controllers/jardins_controller.rb

SELECT "jardins".* FROM "jardins"
---
  def index
    @jardins = Jardin.all

SELECT "jardins".* FROM "jardins" WHERE "jardins"."id" = ? LIMIT ?  [["id", 66], ["LIMIT", 1]]
---
  def show
    @jardin = Jardin.find(params[:id])